"(Not You?)|Login - Clickable text letting user log in as a different user" = "(Bukan Anda?)";

"+%i|Very short string used in place of X names of members of a thread (when the thread name is too long to fit). Ex: +1, +2, +3.  If the language has no short way to express this, use … (ellipsis) or equivalent." = "+%1$i";

",|Punctuation (comma) used to separate entries in a list of names. Example: Alice, Bob, Carol" = ",";

"1 Friend is Nearby|Title of megaphone to encourage user to share location." = "1 Rakan berada Berdekatan";

"1 day|text to show user was online/active 1 day ago (don't abbrev)" = "1 hari";

"1 hour|text to show user was online/active 1 hour ago (don't abbrev)" = "1 jam";

"1 minute|text to show user was online/active 1 minute ago (don't abbrev)" = "1 minit";

"1d|short indicator that a user was active 1 day ago" = "1h";

"1h|short indicator that a user was active 1 hour ago" = "1j";

"1m Limit: Release to send|notify user that the maximum recording time has been reached" = "Had 1 minit: Lepaskan untuk hantar";

"1m|short indicator that a user was active 1 minute ago" = "1m";

"2 days|text to show user was online/active 2 days ago (don't abbrev)" = "2 hari";

"2 hours|text to show user was online/active 2 hours ago (don't abbrev)" = "2 jam";

"2 minutes|text to show user was online/active 2 minutes ago (don't abbrev)" = "2 minit";

"A new version of Messenger is available.|New version title" = "Versi baru Messenger tersedia.";

"Activation Code|placeholder text for activation code field" = "Kod Pengaktifan";

"Activation Request Failed|" = "Permintaan Pengaktifan Gagal";

"Active Now (%d)|Title for chat bar section containing online friends who are not top friends. Number after string is number of friends who are online." = "Aktif Sekarang (%1$d)";

"Add Favorite|Title of screen shown when user is adding a new favorite" = "Tambah Kegemaran";

"Add More People|button for adding people to the conversation" = "Tambah Lagi Orang";

"Add More People|title for add members page" = "Tambah Lagi Orang";

"Add More People|title for add people page" = "Tambah Lagi Orang";

"Add To Conversation|text to show in the add people button" = "Tambah Ke Perbualan";

"Add to Existing Contact|action sheet option for adding a phone number to an existing contact" = "Tambah ke Kenalan Sedia Ada";

"Add|generic add button" = "Tambah";

"Adding...|adding progress text" = "Menambah...";

"Advanced Settings|text for advanced settings button" = "Tetapan Lanjutan";

"Advanced|title for advanced settings page" = "Lanjutan";

"Alerts Off Until %@|Indicates that alerts are off until X time" = "Awasan Dimatikan Sehingga %1$@";

"Alerts Off for 1 Hour|Indicates that alerts are off for 1 hour" = "Awasan Dimatikan selama 1 Jam";

"Alerts Off|Indicates that alerts are off" = "Awasan Dimatikan";

"Alerts On|Indicates that alerts are on" = "Awasan Dihidupkan";

"All notifications are off for 8h.|footer text for notifications settings applying to all conversations" = "Semua pemberitahuan dimatikan untuk 8j";

"All notifications are off.|Mute warning display on thread list" = "Semua pemberitahuan dimatikan.";

"Answer|Text for button that accepts a call" = "Jawab";

"Archive Thread|Button label that will archive the thread" = "Arkib Jaluran";

"Are you sure you want to delete the conversation name?|alert message for deleting conversation name" = "Anda pasti hendak memadamkan nama perbualan?";

"Are you sure you want to leave this conversation? You will no longer receive new messages.|confirmation dialog message for leaving a thread" = "Anda pasti hendak meninggalkan perbualan ini? Anda tidak lagi akan menerima mesej baru.";

"Are you sure?|Title for dialog asking the user if they're sure if they want to not enable push notifications" = "Adakah anda pasti?";

"Attach a Photo|Button label for attaching a photo from the photo library" = "Lampirkan Foto";

"Attach media|Accessibility text for button that lets user start attaching photos or other media, as well as emoticons and emoji" = "Lampirkan media";

"Auto Send|Auto send label" = "Auto Hantar";

"Back|generic nav bar back button" = "Kembali";

"Bing Image Search|" = "Carian Imej Bing";

"Call Ended|End call message in non-error case" = "Panggilan Tamat";

"Call Ended|String shown when the call ends" = "Panggilan Tamat";

"Call Failed|End call message in error case" = "Panggilan Gagal Disambung";

"Call %@|action sheet option for calling a phone number" = "Panggil %1$@";

"Camera|Button label for attaching a photo from the camera" = "Kamera";

"Cancel|Title for generic Cancel button." = "Batal";

"Choose Photo|action sheet option for choosing a photo from photo library" = "Pilih Foto";

"Clear|prompt to clear all unsent messages" = "Kosongkan";

"Clearing...|Progress text shown while clearing the image for a thread" = "Mengosongkan...";

"Clearing...|Progress text shown while clearing the name for a thread" = "Mengosongkan...";

"Close active chat|Button to close an active chat" = "Tutup perbualan aktif";

"Comment|Comment button title" = "Komen";

"Compose message to %@|Accessibility label describing a text view to start writing a message to a user with no draft message" = "Karang mesej kepada %1$@";

"Compose message to %@: %@|Accessibility label describing a text view to start writing a message to a user with some appended draft message" = "Karang  mesej kepada %1$@: %2$@";

"Confirm Phone|Title of page where user enters their phone number" = "Sahkan Telefon";

"Connecting|Text shown on call screen while connecting a call" = "Menyambung";

"Connection Failed|Alert title when connection failed" = "Sambungan Gagal";

"Connection Lost|End call message in connection lost case" = "Sambungan Terputus";

"Contact Info|Title of the canonical thread info page." = "Maklumat Hubungan";

"Contacting|Text shown on call screen while contacting another party" = "Menghubungi";

"Continue|Login - Login Button Title for Keychain Login" = "Teruskan";

"Conversation Name|placeholder text in conversation name textfield" = "Nama Perbualan";

"Copy Link|Option that pops out after long press on a link in message thread." = "Salin Pautan";

"Copy|action sheet option for copying a string to the clipboard" = "Salin";

"Could not add new members. Please try again.|message for failing to add members dialog" = "Tidak dapat menambah ahli baru. Sila cuba lagi.";

"Could not retrieve availability|Text shown to an user when the operation to retrieve the other party's callable status fails" = "Tidak berjaya mendapatkan ketersediaan";

"Countries|Title for country picker" = "Negara";

"Country|Country - Country placeholder text" = "Negara";

"Create Group Conversation|button for adding people to the canonical conversation" = "Buat Perbualan Kumpulan";

"Create New Contact|action sheet option for creating a new contact" = "Buat Kenalan Baru";

"Currently in a call|Error message when user tries to initiate a call while already in a call" = "Sedang dalam panggilan";

"Customize Notification Settings|User education for how to configure conversation alerts" = "Suaikan Tetapan Pemberitahuan";

"Decline|Text for button that declines a call" = "Menolak";

"Delete Conversation Name|alert title for deleting conversation name" = "Padam Nama Perbualan";

"Delete Message? It cannot be undone.|text shown when a user swipes to delete a message" = "Padam Mesej? Langkah ini tidak akan dapat diundur semula.";

"Delete|Button to accept deleting the name of a conversation" = "Padam";

"Delete|Label for button to delete previous character" = "Padam";

"Delete|button text for deleting a message" = "Padam";

"Delete|button text for removing an unsent message" = "Padam";

"Details|title for message details page" = "Butiran";

"Discover Who's Nearby|Title of NUX to encourage user to share location." = "Ketahui Siapa yang berada Berhampiran";

"Discover which friends are nearby and let them know you're around.|Description of megaphone to encourage user to share location." = "Ketahui rakan yang berada berdekatan dan beritahu mereka bahawa anda berada di sekeliling.";

"Discover who's in the area and let them know you're around.|Description of megaphone to encourage user to share location." = "Ketahui siapa yang berada di kawasan ini dan beritahu mereka bahawa anda berada di sekeliling.";

"Dismiss|Dismiss the audio recorder" = "Tolak";

"Don't Delete|Button to decline to delete the name of a conversation" = "Jangan Padam";

"Don't Save|Don't save action sheet button" = "Jangan Simpan";

"Done|Title for generic Done button that dismisses a view. This needs to be a short string to avoid truncation." = "Selesai";

"Download|Button title to download an upgrade" = "Muat Turun";

"Edit|Edit button/label title for chat divebar" = "Edit";

"Email|email field placeholder on login screen" = "E-mel";

"Empty Feedback|Title for empty feedback warning." = "Maklum Balas Kosong";

"Enter Code|Enter Code page title" = "Masukkan Kod";

"Error|error title after failed to load webview" = "Ralat";

"Facebook User|Placeholder name for Facebook user whose name is unknown" = "Pengguna Facebook";

"Failed to add members|title for failing to add members dialog" = "Gagal menambah ahli";

"Failed to save your settings.|error message after changing thread alert setting." = "Gagal menyimpan tetapan anda.";

"Favorites|chat bar favorites header title" = "Kegemaran";

"Free Call|Text on button that starts a messenger call" = "Panggilan Percuma";

"Free Calling Unavailable|Title for dialog explaining that messenger calls are not available" = "Panggilan Percuma Tidak Tersedia";

"Friends of Friends|Table section header for a list of friends of friends search results" = "Rakan kepada Rakan";

"Friends on Messenger|Table title: Friends who have Facebook Messenger" = "Rakan di Messenger";

"Get Directions|action sheet option for viewing a map" = "Dapatkan Arah";

"Get Facebook Messenger|Title of a link that takes the user to download the Facebook Messenger app" = "Dapatkan Facebook Messenger";

"Get Started|Title for NUX" = "Bermula";

"Give us feedback or report a problem|Placeholder text for the report bug or feedback input field" = "Berikan kami maklum balas atau laporkan masalah";

"Google Image Search|" = "Carian Imej Google";

"Group Conversation|Create a group conversation divebar label" = "Perbualan Kumpulan";

"Group Conversation|Label at top of online friends list that takes user to new message composer" = "Perbualan Kumpulan";

"Group Info|Title of group thread info page." = "Maklumat Kumpulan";

"Help|text for help button" = "Bantuan";

"Hold to Talk|The instruction for holding the record button and talk" = "Tahan untuk Bercakap";

"I'm sure|Button label confirming the user wants to continue with the selected action" = "Saya pasti";

"If you enjoy using %@, would you mind taking a moment to rate this update? Thanks!|Prompt for user to rate the app." = "Jika anda seronok menggunakan %1$@, sudikah anda ambil sedikit masa untuk menilai kemas kini ini? Terima kasih!";

"Image Search|action sheet option for choosing a photo from image search" = "Carian Imej";

"Include your location|Title of location NUX when user has not yet made a choice regarding enabling or disabling location services." = "Masukkan lokasi anda";

"Incomplete contact|Alert title: Newly created contact needs more information" = "Kenalan tidak lengkap";

"Incorrect Confirmation Code.|alert title for incorrect confirmation code" = "Kod Pengesahan Salah.";

"Install Facebook Messenger?|The caption to promote users for installing Facebook Messenger app" = "Pasang Facebook Messenger?";

"Install Messenger to listen to this message and record your own.|The detailed message to tell user that the audio clip feature is not supported on the wilde, and then promote a link for them to download the Facebook Messenger app" = "Pasang Messenger untuk mendengar mesej ini dan merakam mesej anda sendiri.";

"Install|Button text to install the Facebook Messenger" = "Pasang";

"Invalid Contact|Alert title: Newly created contact has invalid information" = "Kenalan Tidak Sah";

"Invalid Country Code|alert title for invalid country code" = "Kod Negara Tidak Sah";

"Invalid Phone Number|alert title for invalid phone number" = "Nombor Telefon Tidak Sah";

"Keep everyone in the loop|Detail subtitle for Group Chat NUX slide" = "Beri makluman kepada semua orang";

"Last Updated: %@|last updated date in pull to refresh header" = "Kemas kini terakhir: %1$@";

"Learn More|Title for button to learn more about sharing location." = "Ketahui Lebih Lanjut";

"Leave Conversation|leave conversation button" = "Tinggalkan Perbualan";

"Leave conversation?|confirmation dialog title for leaving a thread" = "Tinggalkan perbualan?";

"Leave|Button title for leaving a thread" = "Tinggalkan";

"Leaving...|Progress text shown while leaving a thread" = "Meninggalkan...";

"Let people in this conversation know where you are.|Text of location NUX when user has not yet made a choice regarding enabling or disabling location services." = "Maklumkan orang dalam perbualan ini di mana anda berada.";

"Licenses|Licenses screen title" = "Lesen";

"Licenses|text for licenses button" = "Lesen";

"Like|Like button title" = "Suka";

"Load Earlier Messages|message for loading earlier messages" = "Muatkan Mesej Lebih Awal";

"Loading...|Message presented while waiting for content to load." = "Memuatkan...";

"Locating You...|Message presented when waiting for an accurate location fix." = "Mencari Lokasi Anda...";

"Location is Disabled|Title for dialog indicating that the app hasn't been granted location permissions" = "Lokasi Dinyahdayakan";

"Location is off for this conversation|Title of location NUX when user turns off location services for the first time." = "Lokasi dimatikan bagi perbualan ini.";

"Location services are off. Turn on to let people in this conversation know where you are.|Text of location NUX when user has disabled location services." = "Perkhidmatan lokasi dimatikan. Hidupkan untuk memberitahu orang dalam perbualan ini di mana anda berada.";

"Location services are on|Title of location NUX when user has enabled location services." = "Perkhidmatan Lokasi dihidupkan";

"Log In to Facebook|Login - Login Button Title for password login" = "Log Masuk ke Facebook";

"Logged in as %@|Login - Text showing who user is logged in as" = "Dilog masuk sebagai %1$@";

"Login Approval Required|title of login approval dialog" = "Kelulusan Log Masuk Diperlukan";

"Login Failed|Invalid login alert title" = "Log Masuk Gagal";

"Map|title of map tab" = "Peta";

"Mark as Unread|Button label that will mark the thread as unread" = "Tanda sebagai Belum Dibaca";

"Meet Friends on the Go|Title of megaphone to encourage user to share location." = "Temui Rakan semasa dalam Perjalanan";

"Message|divebar message button title" = "Mesej";

"Messages|Messenger module display name" = "Pesanan";

"Messages|name of the app with Facebook brand" = "Mesej";

"Messenger|The title of the app, used in Appirater's dialog." = "Messenger";

"More Friends (%d)|Title for chat bar section containing friends who are not top friends. Number after string is number of friends who are online or pushable." = "Lebih Ramai Rakan %1$d";

"More Friends (%d)|Title for chat bar section containing online friends who are not top friends. Number after string is number of friends who are online." = "Lebih Ramai Rakan %1$d";

"More Online Friends|Table title: More friends who are online (but are not top ranked friends)" = "Lebih Rakan Di Talian";

"NOTE: People you add will see all previous messages in this conversation.|warning when adding new people to a thread" = "NOTA: Orang yang anda tambah akan dapat melihat semua mesej terdahulu dalam perbualan.";

"Name is Too Long|alert title for long conversation name" = "Nama Terlalu Panjang";

"Name|Placeholder text: Name of new contact" = "Nama";

"Never miss a message again|Detail subtitle for Push Notification NUX slide" = "Mesej anda tidak akan terlepas lagi.";

"Never miss a message from your friends again.|Body of Messenger NUX page 2" = "Tidak lagi terlepas mesej daripada rakan anda.";

"New Contact|Button title: Create a new contact" = "Kenalan Baru";

"New Message|Title of screen shown when user is composing a new message" = "Mesej Baru";

"New version available|Title of alert displayed when new version is available" = "Versi baru tersedia";

"Next|Generic button to move to next item" = "Seterusnya";

"Next|button label for moving to the next screen" = "Seterusnya";

"No Message|dialog title for when user tries to send an empty message" = "Tiada Mesej";

"No Recipients|dialog title for when user tries to send to no recipients" = "Tiada Penerima";

"No Results|Accessibility label describing a contacts search result with no results" = "Tiada Keputusan";

"No locations shared recently.|message on map view when no location has been shared recently" = "Tiada lokasi dikongsikan baru-baru ini.";

"No response.|Error reported when no response is received from the server" = "Tiada respons.";

"No, Thanks|Label on button for user to decline to rate the app" = "Tidak, Terima kasih";

"Nobody will see exactly where you are.|Explanation to let user know sharing location will not expose his exact location." = "Tiada sesiapa akan tahu dengan tepat di mana anda berada.";

"Not Now|Button text to temporarily ignore the installation message" = "Bukan Sekarang";

"Not Now|Not now alert popup button" = "Bukan Sekarang";

"Not Now|Title of button to not share location for now." = "Bukan Sekarang";

"Not Now|button label for deferring enabling push notifications" = "Bukan Sekarang";

"Not now|Button title to decline an upgrade" = "Bukan sekarang";

"Notifications for This Conversation|Title for per-thread notification settings" = "Pemberitahuan untuk Perbualan Ini";

"Notifications for this conversation are off.|Mute warning display on conversation view" = "Pemberitahuan untuk perbualan ini dimatikan.";

"Notifications|Label for enabling/disabling notification" = "Makluman";

"OK|Title for generic OK button." = "OK";

"Off Until %@|Short string for indicating that alerts are off until X time" = "Dimatikan Sehingga %1$@";

"Off for 1 Hour|Short string for indicating that alerts are off for 1 hour" = "Dimatikan selama 1 Jam";

"Off|Short string for indicating that alerts are off" = "Dimatikan";

"On|Short string for indicating that alerts are on" = "Dihidupkan";

"Open in Maps|action sheet option for opening an address in the Maps app" = "Buka dalam Peta";

"Password|password field placeholder on login screen" = "Kata Laluan";

"People in this conversation can see your location on the map.|Text of location NUX when user has enabled location services." = "Orang dalam perbualan ini boleh melihat lokasi anda di dalam peta.";

"People|Section title for list of thread participants." = "Khalayak";

"People|title of people tab" = "Orang";

"Phone Number|placeholder text for phone number field" = "Nombor Telefon";

"Phone or Email|Placeholder text: Phone or email address of new contact" = "Telefon atau E-mel";

"Pin friends you message most|Label when users have no favorites" = "Pin rakan yang paling sering anda mesej";

"Please check your confirmation code and try again.|alert message for incorrect confirmation code" = "Sila semak kod pengesahan anda dan cuba lagi.";

"Please check your network connection and try again.|" = "Sila semak sambungan rangkaian anda dan cuba lagi.";

"Please check your number and try again.|Error reported when an invalid phone number response is received from the server" = "Sila semak nombor anda dan cuba lagi.";

"Please check your number and try again.|alert message for invalid phone number" = "Sila semak nombor anda dan cuba lagi.";

"Please download the latest version of Facebook Messenger.|Notification displayed to user when a version upgrade is available" = "Sila muat turun versi terkini Facebook Messenger.";

"Please enter a message or attach a photo|dialog message for when user tries to send an empty message" = "Sila masukkan mesej atau lampirkan foto";

"Please enter a phone number or email.|Alert message: Newly created contact has invalid information" = "Sila masukkan nombor telefon atau e-mel.";

"Please enter a valid country code.|alert message for invalid country code" = "Sila masukkan kod negara yang sah.";

"Please enter the email and password you use to log in to Facebook.|Invalid login alert message" = "Sila masukkan e-mel dan kata laluan yang anda gunakan untuk mengelog masuk ke Facebook.";

"Please enter the person's name and contact information.|Alert message: Newly created contact needs more information" = "Sila masukkan nama orang dan maklumat hubungan.";

"Please include a description of your problem.|Message for empty feedback warning." = "Sila masukkan penerangan masalah anda.";

"Please rate the quality of your call|Prompt for call quality survey" = "Sila nilaikan kualiti panggilan anda";

"Please re-login to renew your session.|Error message for expired session" = "Sila log masuk semula untuk memperbaharui sesi anda.";

"Please use a shorter conversation name.|alert message for long conversation name" = "Sila gunakan nama perbualan yang lebih pendek.";

"Preview|title for image preview screen" = "Pratonton";

"Privacy & Terms|text for privacy and terms button" = "Privasi & Terma";

"Pull down to refresh...|message for pull down to refresh" = "Tarik turun untuk segar semula...";

"Push notification alerts are off.|Reminder text for when push alerts are off on the phone." = "Awasan pemberitahuan tolak dimatikan.";

"Push notification sounds are off.|Reminder text for when push notification sounds are off on the phone." = "Bunyi pemberitahuan tolak dimatikan.";

"Push notifications are off.|Reminder text for when push notifications are off on the phone." = "Makluman tolak dimatikan.";

"Push up to refresh...|message for push up to refresh" = "Tolak ke atas untuk segar semula...";

"REC|The record button" = "REC";

"Rate %@|Alert title for asking user to rate this app." = "Nilaikan %1$@";

"Rate %@|Label on button prompting user to rate the app." = "Nilai %1$@";

"Reach friends wherever they are now — mobile or web.|Body of Messenger NUX page 1" = "Capai  rakan di mana saja mereka berada sekarang — mudah alih atau web.";

"Reach friends wherever they are now|Detail subtitle for Cross Platform NUX slide" = "Hubungi rakan-rakan di mana sahaja mereka berada";

"Record Audio|action sheet option for recording some audio" = "Rakam Audio";

"Record Video|action sheet option for recording a video" = "Rakam Video";

"Record Voice|Button label for attaching an audio clip" = "Rekod Suara";

"Record|Record button for voice message" = "Rekod";

"Record|Record button for voice recording" = "Rekod";

"Recorder failed to start|Error info for users saying the audio recorder failed to start." = "Perekod gagal bermula";

"Recording cancelled|Notify user that the recording has been successfully cancelled." = "Rakaman dibatalkan";

"Release to cancel recording|The instruction to user: release the record button to cancel the recording." = "Lepaskan untuk batalkan rakaman";

"Release to refresh...|message for releasing to refresh" = "Lepaskan untuk segar semula...";

"Remind Me Later|Label on button allowing the user to postpone rating the app." = "Ingatkan Saya Kemudian";

"Remove Attachment|action sheet option for removing current attachment" = "Keluarkan Lampiran";

"Remove Photo|action sheet option for removing chosen photo" = "Keluarkan Gambar";

"Remove Photo|action sheet option for removing current attachment" = "Keluarkan Gambar";

"Removing...|text for removing progress" = "Mengeluarkan...";

"Report a Problem|title for give feedback or report bug" = "Laporkan Masalah";

"Resend|Resend - Resend Button Title" = "Hantar semula";

"Retry|generic retry button" = "Cuba semula";

"Save Photo|action sheet option to save photo to library" = "Simpan Foto";

"Save photo as conversation image?|" = "Simpan foto sebagai imej perbualan?";

"Save|" = "Simpan";

"Saving...|Progress text shown while saving a new image for a thread" = "Menyimpan…";

"Saving...|Progress text shown while saving a new name for a thread" = "Menyimpan…";

"Search for Friends|Accessibility label for button that toggles display of friends list/search" = "Cari Rakan";

"Search for More Friends…|Label at bottom of online friends list that lets user search for more friends" = "Cari lebih Ramai Rakan…";

"Search to add favorites|placeholder in edit favorites search bar" = "Cari untuk tambah kegemaran";

"Search|placeholder in search bar" = "Cari";

"Searching...|Placeholder text in a search results list that indicates a contact search is ongoing" = "Sedang Mencari...";

"See which friends are within walking distance or visiting your city, and let them know you're nearby.|Description of NUX to encourage user to share location." = "Lihat rakan yang berada dalam jarak berjalan kaki atau sedang melawat bandar anda, dan beritahu mereka anda berada berhampiran.";

"Seen by Everyone|Seen state text for when everyone has seen the message." = "Dilihat oleh Semua Orang";

"Seen by everyone|Seen state text for when everyone has seen the message." = "Dilihat oleh semua orang";

"Seen by %@ %@|Text for when a message has been seen by 1 person at a certain time or date/time. eg. (Seen by <name> <time>)" = "Dilihat oleh %1$@ %2$@";

"Seen by %@|Text for when a message has been seen by 1 person" = "Dilihat oleh %1$@";

"Seen by %@|Text for when a message has been seen by more than 1 person" = "Dilihat oleh %1$@";

"Seen by:|Text for seen state header" = "Dilihat oleh:";

"Seen %@ near %@|Text for when a message has been sen at a certain time (or date/time) and location e.g. (Seen 3:33 PM near Palo Alto)" = "Dilihat %1$@ berdekatan %2$@";

"Seen %@|Text for when a message has been seen at a certain time or date/time. eg. (Seen 3:33PM) or (Seen Mon 3:33PM)" = "Dilihat %1$@";

"Select country code|select country code text" = "Pilih kod negara";

"Send to Phone, Chat and Web|Call to action for Cross Platform NUX slide" = "Hantar ke Telefon, Ruangan Sembang dan Web";

"Send|Nav bar send button text" = "Hantar";

"Send|Send button for voice message" = "Hantar";

"Send|text to show in the send button" = "Hantar";

"Sending...|sending progress text" = "Menghantar...";

"Sent a message|default notification text for messages with no body text" = "Hantar mesej";

"Sent from Messenger|indicator that a message was sent from Messenger" = "Dihantar dari Messenger";

"Sent from email|indicator that a message was sent from email" = "Dihantar dari e-mel";

"Sent from mobile|indicator that a message was sent sent from a mobile device" = "Dihantar dari mudah alih";

"Sent from web|indicator that a message was sent sent from web or chat" = "Dihantar dari web";

"Sent from %@|Text used for showing the location where a message was sent from. e.g (city) or (city, state) or (city, country)." = "Dihantar daripada %1$@";

"Session Expired|Error title for expired session" = "Sesi Tamat Tempoh";

"Settings App > General > Location Services|Location of Location Services Settings page for before 4.3." = "Aplikasi Tetapan > Umum > Perkhidmatan Lokasi";

"Settings App > Location Services|Location of Location Services Settings page for 4.3 or later." = "Aplikasi Tetapan > Perkhidmatan Lokasi";

"Settings App > Privacy > Location Services|Location of Location Services Settings page for 6.0 or later." = "Tetapan Aplikasi › Privasi › Perkhidmatan Lokasi";

"Settings|Settings alert popup button" = "Tetapan";

"Settings|title for settings page" = "Tetapan";

"Settings|title of settings tab" = "Tetapan";

"Share|Share button title" = "Kongsi";

"Shared a link|text for a link share" = "Berkongsi pautan";

"Shared a photo|text for a photo share" = "Berkongsi foto";

"Shared a video|text for a video share" = "Berkongsi video";

"Sign Up for Facebook|Sign Up - Sign Up Button Title" = "Daftar untuk Facebook";

"Skip|Skip - Skip Button Title" = "Langkau";

"Something went wrong. Want to try again?|retry dialog message" = "Sesuatu masalah telah berlaku. Ingin mencuba semula?";

"Sorry, something went wrong|Generic error message for Web browser errors" = "Maaf, suatu masalah telah berlaku";

"Start Group Chats|Call to action for Group Chat NUX slide" = "Mulakan Sembang Kumpulan";

"Stop attaching media|Accessibility text for button that lets user stop attaching photos or other media, as well as emoticons and emoji" = "Berhenti melampirkan media";

"Stop|Stop button for voice recording" = "Berhenti";

"Submit|Submit button title" = "Hantar";

"Switch Account|text for switching logged in user" = "Tukar Akaun";

"Switch to Wi-Fi to complete your call|Error case when calls not allowed over cellular data. Suggest user switch to WiFi instead." = "Tukar kepada Wi-Fi untuk melengkapkan panggilan anda";

"Take Photo|action sheet option for taking a photo" = "Ambil Foto";

"Tap \"Try Again\" to send this message.|prompt for how to resend a failed message send" = "Ketik \"Cuba Lagi\" untuk menghantar mesej ini.";

"Tap gear to turn on chat|placeholder in search bar when offline" = "Ketik gear untuk hidupkan perbualan";

"Tap to discover who's in the area|Message of in-app notification explaining that user can tap to learn more about sharing location." = "Ketik untuk mengetahui siapa yang berada dalam kawasan";

"Tap to return to call|Message shown on in-call bar explaining that the user may tap on it to return to the call screen" = "Ketik untuk kembali ke panggilan";

"Tap to send a message|Message of in-app notification explaining that user can tap to message to nearby friends." = "Ketik untuk menghantar mese";

"Tap to turn on location|Title of location NUX when user has disabled location services." = "Ketik untuk hidupkan lokasi";

"Text messages can't be sent to that number.|Error reported when a phone number with an unsupported mobile carrier is on the recipients list of a message." = "Mesej teks tidak dapat dihantar ke nombor tersebut.";

"Text your friends wherever they are - on their phones or on chat.|The description message to promote users for installing Facebook Messenger app" = "Menghantar teks kepada rakan anda di mana sahaja mereka berada - pada telefon mereka atau dalam perbualan.";

"That phone number is not allowed to receive text messages.|Error reported when an unlaunched phone number is on the recipients list of a message." = "Nombor telefon itu tidak dibenarkan menerima mesej teks.";

"There was a problem connecting to Facebook. Please check your connection and try again.|error message for failing to connect to Facebook" = "Terdapat masalah bersambung kepada Facebook. Sila semak sambungan anda dan cuba lagi.";

"There was a problem connecting your call. Please connect to Wi-Fi and try again.|Alert body message when connection failed suggesting user switch to wifi" = "Terdapat masalah semasa menyambungkan panggilan anda. Sila sambung ke Wi-Fi dan cuba lagi.";

"This Conversation|header text for alert settings applying to a single conversation" = "Perbualan Ini";

"Timeline|Button text to go to a user's timeline" = "Garis Masa";

"Timeline|divebar timeline button title" = "Garis Masa";

"Tip: Never Miss a Message|Title for reminder to turn on push notifications" = "Petua: Jangan Terlepas Mesej";

"To accept calls, you need to update to the new version of Messenger.|Error dialog body shown when an incoming call failed because the current version is outdated" = "Untuk menerima panggilan, anda perlu mengemas kini kepada versi baru Messenger.";

"To complete your phone number activation, please enter the activation code|" = "Untuk melengkapkan pengaktifan nombor telefon anda, sila masukkan kod pengaktifan";

"To include location with your messages, go to your %@.|Alert dialog instructing the user how to re-enable location permission. The variable is 'Settings App > Location Services' or 'Settings App > General > Location Services'" = "Untuk memasukkan lokasi dengan mesej anda, pergi ke %1$@ anda.";

"To make calls, you need to update to the new version of Messenger.|Error dialog body. Shown when a user attempts to make a VoIP call but their version is incompatible." = "Untuk membuat panggilan, anda perlu mengemas kini kepada versi baru Messenger.";

"To turn off alerts for this conversation, go to conversation settings.|User education for how to configure conversation alerts" = "Untuk mematikan notifikasi untuk perbualan ini, pergi ke tetapan perbualan.";

"To turn off location for all your conversations, go to your %@.|Text of location NUX when user turns off location services for the first time. The parameter is the location of the Location Services in the Settings app (ie. Settings App > Location Services)" = "Untuk mematikan lokasi bagi semua perbualan anda, pergi ke %1$@ anda.";

"To turn on notifications, visit iPhone Settings %@ Notifications %@ Messenger|Body of dialog telling the user how to enable push notifications" = "Untuk menghidupkan makluman, lawati Tetapan iPhone %1$@ Makluman %2$@ Messenger";

"To use this feature, go to your %@ settings and choose Location Services. Select ON for Facebook.|Error explanation when location services are unavailable. {name1} is the name of the current device, e.g. iPhone." = "Untuk menggunakan ciri ini, pergi ke tetapan %1$@ anda dan pilih Perkhidmatan Lokasi. Pilih ON untuk Facebook.";

"To use this feature, go to your %@ settings and tap Privacy, then Location Services. Select ON for Facebook.|Error explanation when location services are unavailable. {name1} is the name of the current device, e.g. iPhone." = "Untuk menggunakan ciri ini, pergi ke tetapan %1$@ dan ketik Privasi, kemudian Perkhidmatan Lokasi. Pilih ON untuk Facebook.";

"To|Accessibility label for to field in contact picker" = "Kepada";

"To:|to field in contact picker" = "Kepada:";

"Touch and hold to talk.\nRelease to send, or slide off the button to cancel.|Instruction text for holding voice record button, letting go to send, and dragging finger off to cancel message" = "Sentuh dan tahan untuk bercakap.\nLepaskan untuk hantar, atau luncurkan butang untuk batal.";

"Try Again|button text for resending an unsent message. this is referred to in the prompt Tap \"Try Again\" text" = "Cuba Lagi";

"Turn Off Chat|Button title to let the user change their chat status from online to offline" = "Matikan Perbualan";

"Turn Off Until 8am|Option to turn off alerts until 8am" = "Matikan Hingga 8 pagi";

"Turn Off for 1h|Option to turn off alerts for 1 hour" = "Matikan selama 1 jam";

"Turn Off|Option to turn off alerts" = "Matikan";

"Turn On Chat|Button title to let the user change their chat status from offline to online" = "Hidupkan Perbualan";

"Turn On Location Services|Error message title when location services are unavailable." = "Buka Perkhidmatan Lokasi";

"Turn On Notifications|Call to action in NUX encouraging user to turn on push notifications" = "Matikan Pemberitahuan";

"Turn On Notifications|Title of dialog telling the user how to enable push notifications" = "Hidupkan Makluman";

"Turn On|Option to turn on alerts" = "Hidupkan";

"Turn On|Turn on alerts" = "Hidupkan";

"Turn On|button label for deferring enabling push notifications" = "Hidupkan";

"Turn on Push Notifications|Call to action for Push Notification NUX slide" = "Hidupkan Laporan Push";

"Turn on push notifications to find out when new messages arrive.|Message for reminder to turn on push notifications" = "Hidupkan pemberitahuan push untuk mengetahui masa mesej baru sampai.";

"Typing…|Text for when the other user is typing. Ends with an ellipsis (U+2026) and is lower-case." = "Menaip…";

"Unable to Call %@|Error dialog title. Shown when app must be updated" = "Tidak dapat Memanggil %1$@";

"Unable to Play Voice Message|The message to show when user receives a voice message but his app doesn't support playing it back." = "Tidak dapat Memainkan Mesej Suara";

"Unable to Save Image|retry dialog title for setting thread image" = "Gagal Menyimpan Imej";

"Unable to Send|Title for send feedback failed warning." = "Tidak Dapat Menghantar";

"Unable to add more people to the conversation. Please try again.|error message for failing to add people" = "Gagal untuk menambah lebih ramai orang ke perbualan. Sila cuba lagi.";

"Unable to name your conversation.|error message after setting conversation name" = "Gagal menamakan perbualan anda.";

"Unable to remove you right now.|error messages after leaving conversation" = "Gagal mengeluarkan anda pada masa ini.";

"Unable to save messaging favorites to Facebook|error message for failing to save messaging favorites" = "Gagal menyimpan kegemaran mesej ke Facebook";

"Unable to send message. Retry?|Alert text for when a message failed to send that also asks user to retry." = "Gagal menghantar mesej. Cuba semula?";

"Unable to send message.|Alert text for when a message failed to send." = "Gagal menghantar mesej.";

"Unable to send right now.|error message for failing to send message" = "Gagal dihantar pada masa ini.";

"Unpin|button title to remove user from favorites" = "Buka pin";

"Update|Get new version now button." = "Kemas kini";

"Updating...|updating progress text" = "Mengemas kini...";

"Upgrade Now|button text on alert dialog prompting user to upgrade app" = "Naik Taraf Sekarang";

"Use|use nav bar button in photo preview screen" = "Guna";

"View Call|Text show on button that views an incoming call" = "Lihat Panggilan";

"View in Maps|action sheet option for viewing a map" = "Lihat dalam Peta";

"View|Alert button that takes user to the thread where a message failed to send" = "Lihat";

"We'll text you a link to confirm your number.|Confirmation information text" = "Kami akan sms pautan kepada anda untuk tujuan pengesahan nombor telefon anda.";

"Welcome to Messenger|Title for NUX page" = "Selamat Datang ke Messenger";

"Who would you like to send this message to?|dialog message for when user tries to send message to no recipients" = "Kepada siapa anda hendak menghantar mesej ini?";

"You can control this in your privacy settings.|Explanation to let user know he can change settings of sharing location." = "Anda boleh mengawal ini dalam tetapan privasi anda.";

"You will get an SMS or email shortly with a code to use for logging in.|message in login approval dialog" = "Anda akan menerima SMS atau e-mel seketika nanti dengan kod untuk digunakan bagi mengelog masuk.";

"You won't find out when you've received a message.|Body of dialog encouraging the user to enable push notifications" = "Anda tidak akan tahu apabila anda telah menerima mesej.";

"Your carrier doesn't allow calling with Messenger. Please turn on Wi-Fi in your phone settings.|Error message when user tries to initiate a call if carrier doesn't allowVOIP and not on wifi" = "Pembawa anda tidak membenarkan panggilan dengan Messenger. Sila hidupkan Wi-Fi dalam tetapan telefon anda.";

"Your message was not sent.|text shown when a message failed to send" = "Mesej anda tidak dihantar.";

"Your messages were not sent.|text shown when more than 1 message failed to send" = "Mesej anda tidak dihantar.";

"…|Ellipsis (U+2026) used to represent a chat message that is currently being written" = "...";

"active 1d ago|indicator that a user was active 1 day ago" = "aktif 1hr yang lalu";

"active 1h ago|indicator that a user was active 1 hour ago" = "aktif 1 jam yang lalu";

"active 1m ago|indicator that a user was active 1 minute ago" = "aktif 1 min yang lalu";

"active now|indicator that a user is currently active, on web or mobile" = "aktif sekarang";

"active on mobile %@ ago|presences status for being active on mobile a relative time ago" = "aktif pada mudah alih %1$@ lalu";

"active on mobile|presences status for being active on mobile" = "aktif pada mudah alih";

"active %id ago|indicator that a user was active 2+ days ago" = "aktif %1$ihr yang lalu";

"active %ih ago|indicator that a user was active 2+ hours ago" = "aktif %1$i jam yang lalu";

"active %im ago|indicator that a user was active 2+ minute ago" = "aktif %1$i min yang lalu";

"active %@ ago|presences status for being active a relative time ago" = "aktif  %1$@ lalu";

"error|A short message for audio play error" = "ralat";

"is calling|text below the caller's name when they are calling" = "sedang memanggil";

"is typing…|text for when the other user is typing. ends with an ellipsis (U+2026) and is lower-case. name appears on left" = "sedang menaip…";

"on mobile|presences status for being available on mobile" = "pada mudah alih";

"online %@ ago|presences status for being online on the web a relative time ago" = "dalam talian %1$@ lalu";

"online|presences status for being online on the web" = "dalam talian";

"typing…|text for when the other user is typing. ends with an ellipsis (U+2026) and is lower-case." = "menaip…";

"%d of %d|Title on photo viewer screen showing which photo is currently displayed. eg. 2 of 3" = "%1$d daripada %2$d";

"%i Friend of Friends|Number of friends of friends in search result (singular)" = "%1$i Rakan kepada Rakan";

"%i Friend|Number of friends in search result (singular)" = "%1$i Rakan";

"%i Friends of Friends|Number of friends of friends in search result (plural)" = "%1$i Rakan kepada Rakan";

"%i Friends|Number of friends in search result (plural)" = "%1$i Rakan";

"%i days|text to show user was online/active N days ago (don't abbrev)" = "%1$i hari";

"%i hours|text to show user was online/active N hours ago (don't abbrev)" = "%1$i jam";

"%i minutes|text to show user was online/active N minutes ago (don't abbrev)" = "%1$i minit";

"%id|short indicator that a user was active 2+ days ago" = "%1$ih";

"%ih|short indicator that a user was active 2+ hours ago" = "%1$ij";

"%im|short indicator that a user was active 2+ minute ago" = "%1$im";

"%@  •  %@|Seen state text for a user in a group detail page. eg. (name <bullet-character> time)" = "%1$@ • %2$@";

"%@ and %@ use Facebook Messenger|Upsell message for promoting Facebook Messenger. It shows how many your friends are already using Messenger" = "%1$@ dan %2$@ menggunakan Facebook Messenger";

"%@ are Nearby|Title of in-app notification showing some friends are nearby. E.g. Tom, Jerry, +2 are Nearby" = "%1$@ berada Berhampiran";

"%@ is Nearby|Title of in-app notification showing some friend is nearby. E.g. Tom is Nearby" = "%1$@ berada Berhampiran";

"%@ is calling|Message notifying of an incoming call. First parameter is the name of the caller" = "%1$@ sedang memanggil";

"%@ is in another call|End call message notifying caller that callee is unavailable. First parameter is the name of the callee" = "%1$@ berada dalam panggilan lain";

"%@ is not available|End call message notifying caller that callee is unavailable. First parameter is the name of the callee" = "%1$@ tidak tersedia";

"%@ is typing…|string format text for when the other user is typing. ends with an ellipsis (U+2026) and is lower-case. name appears on left" = "%1$@ sedang menaip…";

"%@ tried to call you|Error dialog title shown when an incoming voice call can't be received" = "%1$@ cuba memanggil anda";

"%@ uses Facebook Messenger|Upsell message for promoting Facebook Messenger. It shows how many your friends are already using Messenger" = "%1$@ menggunakan Facebook Messenger";

"%@|Name of a person (used both standalone and in lists). Add honorifics (-san, etc.) if appropriate." = "%1$@";

"%@, %i more|List of user names and X more if the list is truncated at N names." = "%1$@, %2$i lagi";

"%@, %@ and %@ use Facebook Messenger|Upsell message for promoting Facebook Messenger. It shows how many your friends are already using Messenger" = "%1$@, %2$@ dan %3$@ menggunakan Facebook Messenger";

"%@, %@, %@ and 1 other friend use Messenger|Upsell message for promoting Facebook Messenger. It shows how many your friends are already using Messenger" = "%1$@, %2$@, %3$@ dan 1 rakan lain menggunakan Messenger";

"%@, %@, %@ and %i other friends use Messenger|Upsell message for promoting Facebook Messenger. It shows how many your friends are already using Messenger" = "%1$@, %2$@, %3$@ dan %4$i rakan lain menggunakan Messenger";

"%@…|a string that has been shortened adding ellipsis (unicode 2026)" = "%1$@...";

"%u Friend is Nearby|Title of in-app notification showing some friend is nearby. E.g. 1 Friend is Nearby" = "%1$u Rakan berada Berhampiran";

"%u Friends are Nearby|Title of in-app notification showing some friends are nearby. E.g. 2 Friends are Nearby" = "%1$u Rakan berada Berdekatan";

"%u Friends are Nearby|Title of megaphone to encourage user to share location. E.g. 2 Friends are Nearby." = "%1$u Rakan berada Berdekatan";

"%u of your friends are sharing when they're nearby|Message to let user know how many of his friends are sharing location." = "%1$u daripada rakan anda berkongsi semasa mereka berada berhampiran";

"%u photo attached|Accessiblity text for a single photo" = "%1$u foto dilampirkan";

"%u photos attached|Accessibility text for a photo set" = "%1$u gambar dilampirkan";

